tests/artillery/login-pages-load-tests.yaml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://localhost:8000
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 2
      name: Warm-up
    - duration: 90
      arrivalRate: 2
      rampTo: 5
      name: Ramp-up
    - duration: 45
      arrivalRate: 5
      rampTo: 7
      name: Spike load
    - duration: 60
      arrivalRate: 2
      rampTo: 1
      name: Cool down
  defaults:
    headers:
      Accept: "application/json"
      User-Agent: "Artillery-Laravel-Test"
  plugins:
    apdex:
      threshold: 1100
    ensure:
      thresholds:
        - http.response_time.p95: 1200
        - http.response_time.p99: 2000
        - http.codes.200: 88    
        - http.request_rate: 10
    metrics-by-endpoint: {} 
scenarios:
  - flow:
      - get:
          url: '/login'
      - think: 1
      - get:
          url: '/admin/login'
      - think: 1
      - get:
          url: "/"