tests/artillery/login-pages-load-tests.yaml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://127.0.0.1:8000
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  plugins:
    ensure:
      thresholds:
        - http.response_time.p99: 100
        - http.response_time.p95: 75
    apdex:
      threshold: 100
    metrics-by-endpoint: {}
scenarios:
  - flow:
      - loop:
          - get:
              url: '/login'
          - get:
              url: '/admin/login'
        count: 100